
message_add = "У вас уже добавлены акции, если вы хотите их изменить нажмите кнопку 'Изменить'"
message_add_another = "\U000025ABВведите акции которые хотите добавить вот так : <i>название/количество</i> \n\U000025ABЕсли вводить количество, то будет подсчитана общая цена портфеля на данный момент\n\U000025ABЕсли количество не вводить, то будут выведены текущие цены для каждой акции \n\U000025ABДанные хранятся 1 месяц\nПример ввода:\n<code>Spce/2 tsla/3 swks/1</code>"

message_edit = "\U000025ABВведите акции которые хотите сохранить\nПример: <code>Spce/2 tsla/3 swks/1</code>"

message_start = "Привет!\nПока я мало что могу и ломать меня не надо, а то сломаюсь\nПока стоит действовать по инструкции Напиши мне тикер и дождись ответа\nТеперь введи тикер(ы) через пробел и жди"

message_help = "Здесь перечислены все команды которые я знаю\n/start - чтобы вернуться к началу\n/help - чтобы узнать список всех команд\nНапишите <code>Тикер</code> для получения цены акции"

message_portfolio = "\U000025ABВы можете сохранить ряд акций которые вам интересны в портфель и быстро получать доступ к ним\n\U000025ABДобавить - добавить список акций\n\U000025ABИзменить - изменить существующий список акций\n\U000025ABУзнать цену - получить цену имеющегося списка акций"